import React from 'react';
import CurlySVG from '../components/CurlySVG.js';
import HomeProducts from '../components/HomeProducts.js';

function useOnScreen(options) {
	const ref = React.useRef();
	const [visible, setVisible] = React.useState(false);

	React.useEffect(() => {
		const observer = new IntersectionObserver(([entry]) => {
			setVisible(entry.isIntersecting);
		}, options);

		if (ref.current) {
			observer.observe(ref.current);
		}
	}, [ref, options]);
	return [ref, visible];
}

export default function About() {
	const [ref, visible] = useOnScreen({ rootMargin: '-1px' });

	const low =
		'M0,1034.015c0,0-3.521,101.979,103.235,46.377C311.931,971.695,177.388,615.666,275.696,663c39.13,18.841,37.681,500,292.753,460.869c207.485-31.831-53.62-211.594,49.275-362.318c121.699-178.269,182.479,459.704,262.319,421.739c207.25-98.551,37.798-142.873,113.043-234.783c215.942-263.768,94.107,208.804,291.305,210.146c241.311,1.642-42.964-425.29,23.188-415.942c133.333,18.841,267.205,446.205,327.536,343.479c160.869-273.913,11.595,173.913,185.508-79.71c355.178-517.967,14.492,136.231,111.594,146.377c117.571,12.284,156.782-75.362,156.782-75.362V1269H0V1034.015z';
	const high =
		'M0,0c0,0,82.942,0,159.753,0c106.144,0-42.029,0,92.754,0 c149.106,0,40.58,0,185.507,0c169.224,0,62.319,0,181.159,0c103.397,0,27.536,0,115.942,0c106.893,0,8.753,0.13,127.536,0 c107.139-0.118,15.846-1.341,213.043,0c241.311,1.642,128.986,0,236.232,0c103.396,0,34.782,0,192.754,0 c163.98,0,58.083,0,227.536,0c172.464,0,91.304,0,205.797,0C2056.226,0,2089,0,2089,0v1269H0V0z';

	return (
		<div className='about' id='about' ref={ref}>
			<h1>About Us</h1>
			<p className='aboutText'>
				小小巷弄裡的幸福小窩，有我們對生活的努力與堅持，
				<br />
				喜歡用手創造喜悅、喜歡用手實現創意，
				<br />
				小窩裡將會有先生的木手作、我的布手作、
				<br />
				過陣子還會加入手作達人的創作，
				<br />
				手作之外，我也從日本帶回一些材料包及素材，
				<br />
				還有一些生活雑貨及擺飾，
				<br />
				歡迎你來小窩，讓我有機會為你奉上一杯咖啡、一焙花茶，
				<br />
				我們一同說生活、話理想，一起玩手作！
				<br />
				雖說中年之後才來圓年輕時候的夢想，似乎有一點兒慢，
				<br />
				卻與我這「慢慢」個性不謀而合， 總是慢慢來的我，
				<br />
				結婚比別人慢、生孩子比別人慢、連圓夢都比別人慢，
				<br />
				沒關係，慢工出細活，
				<br />
				慢中自有一份安靜自在，慢中也體會出生活中的「要」與「不要」，
				<br />
				這是年輕時候的我缺少的悠閒， 雖然眼花了、手不巧了，
				<br />
				心卻自有清明恬適，正適合作手作！ 陸陸續續擺上我們的手作物，
				<br />
				另一個角落有精緻的生活雑貨。 很感恩身邊總有許多貴人的支持，
				<br />
				讓我總是有「繼續努力」的動力， 想起那句話，
				<br />
				當你努力想完成一個夢想時， 全世界都會湧來幫助你！
				<br />
			</p>
			<HomeProducts />
			<CurlySVG duration='1000' visible={visible} low={low} high={high} />
		</div>
	);
}
